<?php
/*  Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
*/

    $regCity = [
        'Архангельская область' => [
            'Архангельск',
            'Котлас',
            'Вельск',
            'Коряжма',
            'Шенкурск'
        ],
        'Вологодская область' => [
            'Вологда',
            'Великий Устюг',
            'Тотьма',
            'Бабушкина'
        ],
        'Кировская область' => [
            'Киров',
            'Мураши',
            'Луза',
            'Подосиновец'
        ]
    ];

    foreach ($regCity as $key => $value) {
        echo "$key:<br>";
        $city = "";
        for ($i = 0, $count = count($value); $i < $count; $i++) {
            if (mb_substr($value[$i], 0, 1) === 'К') {
                $city .= "$value[$i], ";
            }
        }
        if ($city !== "") {
            echo mb_substr($city, 0, count($city) - 3).'<br>';
        } else {
            echo "Города на букву 'К' не найдены!!!<br>";
        }
    }
?>